docs: replace sequence mermaid diagrams with plantuml
